define m = Character("Максвел", color="#597bd1")
define n = Character("Неллі", color="#cf5488")
define nn = Character("???")

label start:

    scene bg room

    show eileen happy

    m "Я не розумію де знаходжуся."
    m "Я не розумію чи я взагалі існую..."
    m "...чи мене хтось помічає, цінує, чи любить..."

    m "Я знаю тільки одне: я тут, у цьому безмежному просторі, де немає ні світла, ні звуку, ні тепла, ні холоду..."
    m "Тут немає нічого, окрім мене і моїх думок."

    m "Як я сюди потрапив? Я не пам'ятаю, що було раніше. Я не пам'ятаю, що призвело до цього..."
    m "Чи це був сон, чи реальність..."
    m "Я пам'ятаю тільки як я був щасливим."

    m "І тепер я тут, у цій пітьмі, де я наодинці з власними думками. І мені тут добре..."
    m "Мені добре, бо я не відчуваю болю..."
    m "Не маю жодних потреб..."
    m "Мені добре, бо я ні від кого не залежу..."
    m "Не несу ніякої відповідальності."

    m "Я не сподіваюся ні на що."
    m "Я не сподіваюся на диво..."
    m "...на сигнал..."
    m "...на голос."

    m "Я просто живу...Живу в своєму світі..."
    m "Я живу в своїй пітьмі, в своїй ейфорії."
    m "Я живу у своїй байдужості...Я живу для себе, для своїх думок, спогадів і почуттів."

    nn "???"

    "Максвел почув якийсь невідомий шум здалеку."

    nn "???"

    nn "Прокинься!"

    "Головний герой розплющив очі і побачив перед собою розмитий силует."
    "Йому кортіло спитати котра година, проте, відкривши очі, він побачив не свою маму, а когось іншого."

    m "Де я? Хто ти? Що тут взагалі відбувається?"

    n "Мене звати Неллі. - відповіла занепокоїно дівчина. - Я прокинулась досить давно, в мене ніяк не виходило розбудити тебе."

    m "Як я тут опинився? Це ти в цьому винна?!"

    n "Я розумію, що ти наляканий, але не потрібно кричати. Я також не розумію, як ми сюди потрапили."

    m "..."

    n "Як я можу звертатись до тебе?"

    m "Я Максвел, але можна просто Макс."

    "Максвел і Неллі ретельно досліджують підземелля, обговорюючи місцеві дивовижності."

    m "(сам до себе) Дивно, тут відносно світло для підземелля. І ці камені... чому вони світяться?"

    n "(розмірковуючи) Ніколи не бачила такого, мене це лякає."

    m "А от ці кістки та черепи... це виглядає тривожно."

    n "Можливо, це тут давно, і ми не перші, хто опинився в цьому місці... Що нам робити?"

    m "Не знаю, але ці черепи ставлять під сумнів нашу безпеку."
    m "Ми повинні бути обережними та не залишатись тут надто довго."

    return
